In [1]:
import pandas as pd
import numpy as np

In [2]:
matris = (np.random.rand(4,4)*100).round()
tablo = pd.DataFrame(data=matris , index = ["A","B","C","D"], columns = ["X","Y","Z","T"])
tablo

      X      Y     Z     T
A  52.0   64.0  71.0  86.0
B  20.0   32.0  78.0  93.0
C  38.0  100.0  95.0  31.0
D  40.0   10.0  83.0  43.0

In [3]:
tablo.loc["C"]

X     38.0
Y    100.0
Z     95.0
T     31.0
Name: C, dtype: float64

In [4]:
tablo.loc[["C"]]

      X      Y     Z     T
C  38.0  100.0  95.0  31.0

In [5]:
tablo.iloc[[2]]

      X      Y     Z     T
C  38.0  100.0  95.0  31.0

In [6]:
tablo.iloc[2:,]

      X      Y     Z     T
C  38.0  100.0  95.0  31.0
D  40.0   10.0  83.0  43.0

In [7]:
tablo.iloc[2:,]

      X      Y     Z     T
C  38.0  100.0  95.0  31.0
D  40.0   10.0  83.0  43.0

In [19]:
tablo.iloc[1,1]

32.0

In [22]:
tablo

      X      Y     Z     T
A  52.0   64.0  71.0  86.0
B  20.0   32.0  78.0  93.0
C  38.0  100.0  95.0  31.0
D  40.0   10.0  83.0  43.0

In [21]:
tablo.iloc[1:3,2:4]

      Z     T
B  78.0  93.0
C  95.0  31.0